openid_sample/app/controllers/sessions_controller.rb

SELECT * FROM "users" WHERE ("users"."identity_url" = 'https://www.google.com/accounts/o8/id?id=AItOawkNk6RIYgDPI-pKWwnhpox4ibi_7vUapRk') LIMIT 1
---
  def complete
    complete_open_id_authentication do |result, identity_url, sreg|
      if User.find_by_identity_url identity_url