openid_sample/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "nickname", "updated_at", "identity_url") VALUES('2009-06-25 15:16:17', 'toshiki', '2009-06-25 15:16:17', NULL)
---
  def create
    @current_user = User.new(params[:user])
    @current_user.identity_url = session[:identity_url]
    @current_user.save!